app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 10)
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 13 Dec 2013 01:33:33 UTC +00:00], ["description", "this should be associated with a user"], ["updated_at", Fri, 13 Dec 2013 01:33:33 UTC +00:00], ["user_id", 1]]